In [196]:
import numpy as np
import pandas as pd
a = pd.Series([1, np.nan, 3, None, 5, np.nan])
print(a)

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
5    NaN
dtype: float64

In [197]:
a = pd.Series([1, np.nan, 3, None, 5])
print(a + 1)
print(a * 2)

0    2.0
1    NaN
2    4.0
3    NaN
4    6.0
dtype: float64
0     2.0
1     NaN
2     6.0
3     NaN
4    10.0
dtype: float64

In [198]:
b = pd.Series([2, 4, 6, 8, 10])
print(a + b)

0     3.0
1     NaN
2     9.0
3     NaN
4    15.0
dtype: float64

In [199]:
print(a)
print(a.sum())
print(a.min())
print(a.max())
print(a.mean())

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64
9.0
1.0
5.0
3.0

In [200]:
print(a)
print(a.isna())

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64
0    False
1     True
2    False
3     True
4    False
dtype: bool

In [201]:
print(a.isnull())

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [202]:
print(a[a.isna()])

1   NaN
3   NaN
dtype: float64

In [203]:
print(a[a.isnull()])

1   NaN
3   NaN
dtype: float64

In [204]:
print(a)
print(a.notna())

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64
0     True
1    False
2     True
3    False
4     True
dtype: bool

In [205]:
print(a.notnull())

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [206]:
print(a[a.notna()])

0    1.0
2    3.0
4    5.0
dtype: float64

In [207]:
print(a[a.notnull()])

0    1.0
2    3.0
4    5.0
dtype: float64

In [208]:
print(a)
print(a.isna().any())

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64
True

In [209]:
print(a.isna())

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [210]:
print(a.isna().sum())

2

In [211]:
print(a.dropna())

0    1.0
2    3.0
4    5.0
dtype: float64

In [212]:
print(a.fillna(0))

0    1.0
1    0.0
2    3.0
3    0.0
4    5.0
dtype: float64

In [213]:
print(a.fillna("Missing"))

0        1.0
1    Missing
2        3.0
3    Missing
4        5.0
dtype: object

In [214]:
df = pd.DataFrame({"name": ["Jack", "Joe", "Charlie", "Frank", "Jonny"],
 "age": [31, 29, np.nan, 57, np.nan],
 "height": [np.nan, 193, 194, 183, 155]})
display(df)

      name   age  height
0     Jack  31.0     NaN
1      Joe  29.0   193.0
2  Charlie   NaN   194.0
3    Frank  57.0   183.0
4    Jonny   NaN   155.0

In [215]:
print(df.sum())

name      JackJoeCharlieFrankJonny
age                          117.0
height                       725.0
dtype: object

In [216]:
df.min()

name      Charlie
age          29.0
height      155.0
dtype: object

In [217]:
print(df.max())

name      Jonny
age        57.0
height    194.0
dtype: object

In [218]:
df.mean(numeric_only=True)

age        39.00
height    181.25
dtype: float64

In [219]:
print(df.isna())

    name    age  height
0  False  False    True
1  False  False   False
2  False   True   False
3  False  False   False
4  False   True   False

In [220]:
print(df.age.isna())

0    False
1    False
2     True
3    False
4     True
Name: age, dtype: bool

In [221]:
print(df.height.isna())

0     True
1    False
2    False
3    False
4    False
Name: height, dtype: bool

In [222]:
print(df[df.age.isna()])

      name  age  height
2  Charlie  NaN   194.0
4    Jonny  NaN   155.0

In [223]:
print(df.name[df.height.isna()])

0    Jack
Name: name, dtype: object

In [224]:
print(df.notna()) # return dataframe with booleans

   name    age  height
0  True   True   False
1  True   True    True
2  True  False    True
3  True   True    True
4  True  False    True

In [225]:
print(df.age.notna()) # returns serie with boolean values

0     True
1     True
2    False
3     True
4    False
Name: age, dtype: bool

In [226]:
print(df.height.notna())

0    False
1     True
2     True
3     True
4     True
Name: height, dtype: bool

In [227]:
print(df[df.height.notna()])

      name   age  height
1      Joe  29.0   193.0
2  Charlie   NaN   194.0
3    Frank  57.0   183.0
4    Jonny   NaN   155.0

In [228]:
print(df.age[df.height.notna()])

1    29.0
2     NaN
3    57.0
4     NaN
Name: age, dtype: float64

In [229]:
print(df.loc[df.height.notna(), ["name", "height"]])

      name  height
1      Joe   193.0
2  Charlie   194.0
3    Frank   183.0
4    Jonny   155.0

In [230]:
display(df)

      name   age  height
0     Jack  31.0     NaN
1      Joe  29.0   193.0
2  Charlie   NaN   194.0
3    Frank  57.0   183.0
4    Jonny   NaN   155.0

In [231]:
df.isna().any()

name      False
age        True
height     True
dtype: bool

In [232]:
df.isna().sum()

name      0
age       2
height    1
dtype: int64

In [233]:
df.fillna(0)

      name   age  height
0     Jack  31.0     0.0
1      Joe  29.0   193.0
2  Charlie   0.0   194.0
3    Frank  57.0   183.0
4    Jonny   0.0   155.0

In [234]:
df.fillna("Missing")

      name      age   height
0     Jack     31.0  Missing
1      Joe     29.0    193.0
2  Charlie  Missing    194.0
3    Frank     57.0    183.0
4    Jonny  Missing    155.0

In [235]:
df.fillna(method = 'ffill', axis = 1) # column

/tmp/ipykernel_20228/1975331486.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'ffill', axis = 1) # column

      name      age height
0     Jack     31.0   31.0
1      Joe     29.0  193.0
2  Charlie  Charlie  194.0
3    Frank     57.0  183.0
4    Jonny    Jonny  155.0

In [236]:
df.fillna(method = 'ffill', axis = 0) # row (default)

/tmp/ipykernel_20228/1555648055.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'ffill', axis = 0) # row (default)

      name   age  height
0     Jack  31.0     NaN
1      Joe  29.0   193.0
2  Charlie  29.0   194.0
3    Frank  57.0   183.0
4    Jonny  57.0   155.0

In [237]:
df.fillna(method = 'bfill', axis = 1) # column

/tmp/ipykernel_20228/2723862662.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'bfill', axis = 1) # column

      name    age height
0     Jack   31.0    NaN
1      Joe   29.0  193.0
2  Charlie  194.0  194.0
3    Frank   57.0  183.0
4    Jonny  155.0  155.0

In [238]:
df.fillna(method = 'bfill', axis = 0) # row

/tmp/ipykernel_20228/1137052672.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'bfill', axis = 0) # row

      name   age  height
0     Jack  31.0   193.0
1      Joe  29.0   193.0
2  Charlie  57.0   194.0
3    Frank  57.0   183.0
4    Jonny   NaN   155.0

In [239]:
display(df)

      name   age  height
0     Jack  31.0     NaN
1      Joe  29.0   193.0
2  Charlie   NaN   194.0
3    Frank  57.0   183.0
4    Jonny   NaN   155.0

In [240]:
df.fillna(df.mean(numeric_only=True), inplace = True)
display(df)

      name   age  height
0     Jack  31.0  181.25
1      Joe  29.0  193.00
2  Charlie  39.0  194.00
3    Frank  57.0  183.00
4    Jonny  39.0  155.00

In [241]:
# Setup df again to overwrite the inplace = True from the last line
df = pd.DataFrame({"name": ["Jack", "Joe", "Charlie", "Frank"],
 "age": [31, 29, np.nan, 57],
 "height": [np.nan, 193, 194, 183]})
display(df)
df.dropna()

      name   age  height
0     Jack  31.0     NaN
1      Joe  29.0   193.0
2  Charlie   NaN   194.0
3    Frank  57.0   183.0

    name   age  height
1    Joe  29.0   193.0
3  Frank  57.0   183.0

In [242]:
# Drop all columns containing a missing value
df.dropna(axis = "columns")

      name
0     Jack
1      Joe
2  Charlie
3    Frank

In [243]:
df.dropna(axis = 1)

      name
0     Jack
1      Joe
2  Charlie
3    Frank

In [244]:
df.dropna(axis = 'columns', how ='all')

      name   age  height
0     Jack  31.0     NaN
1      Joe  29.0   193.0
2  Charlie   NaN   194.0
3    Frank  57.0   183.0

In [245]:
df.dropna(axis = 'rows', thresh = 1)

      name   age  height
0     Jack  31.0     NaN
1      Joe  29.0   193.0
2  Charlie   NaN   194.0
3    Frank  57.0   183.0

In [246]:
df.dropna(axis = 'rows', thresh = 3)

    name   age  height
1    Joe  29.0   193.0
3  Frank  57.0   183.0